1. 지도학습 with labeled data 
- 분류(Classification)
    - 의사결정트리 DecisionTreeClassifier
- 회귀(Regression) 
    - 선형회귀 Linear Regression

In [6]:
import pandas as pd
import numpy as np

Chapter 01 | 파이썬 기반의 머신러닝과 생태계 이해
======

In [6]:
titanic_df = pd.read_csv("train.csv")
#titanic_df.describe()
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [53]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)  # only defined by series Q1.시리즈의 인덱스틑 어떻게 추출?
print(value_counts.index) # A1(pp.57:index객체)

3    491
1    216
2    184
Name: Pclass, dtype: int64
Int64Index([3, 1, 2], dtype='int64')

In [11]:
titanic_pclass = titanic_df['Pclass']
# print(titanic_pclass)
# print(type(titanic_pclass))
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [50]:
titanic_df['Age_0']=0
#titanic_df.head(3)
titanic_df['Age_by_10']=titanic_df['Age']*10
titanic_df['Family_No']=titanic_df['SibSp']+titanic_df['Parch']+1
titanic_df.head(3)

   PassengerId  Survived  Pclass         Name     Sex   Age  SibSp  Parch       Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
0            1         0       3  Braund, ...    male  22.0      1      0    A/5 21171   7.2500   NaN        S      0      220.0          2
1            2         1       1  Cumings,...  female  38.0      1      0     PC 17599  71.2833   C85        C      0      380.0          2
2            3         1       3  Heikkine...  female  26.0      0      0  STON/O2....   7.9250   NaN        S      0      260.0          1

In [51]:
drop_result = titanic_df.drop(['Age_0','Age_by_10','Family_No'], axis=1, inplace=True)
print('inplace=False로 drop 후 반환된 값 : ', drop_result)
titanic_df.head(3)

inplace=False로 drop 후 반환된 값 :  None

   PassengerId  Survived  Pclass         Name     Sex   Age  SibSp  Parch       Ticket     Fare Cabin Embarked
0            1         0       3  Braund, ...    male  22.0      1      0    A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings,...  female  38.0      1      0     PC 17599  71.2833   C85        C
2            3         1       3  Heikkine...  female  26.0      0      0  STON/O2....   7.9250   NaN        S

In [52]:
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 12)
print('### before axis 0 drop ###')
print(titanic_df.head(3))
print('### after axis 0 drop ###')
drop = titanic_df.drop([0,1,2], axis=0, inplace=False)
print(drop)

### before axis 0 drop ###
   PassengerId  Survived  Pclass         Name     Sex   Age  SibSp  Parch       Ticket     Fare Cabin Embarked
0            1         0       3  Braund, ...    male  22.0      1      0    A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings,...  female  38.0      1      0     PC 17599  71.2833   C85        C
2            3         1       3  Heikkine...  female  26.0      0      0  STON/O2....   7.9250   NaN        S
### after axis 0 drop ###
     PassengerId  Survived  Pclass         Name     Sex   Age  SibSp  Parch      Ticket     Fare Cabin Embarked
3              4         1       1  Futrelle...  female  35.0      1      0      113803  53.1000  C123        S
4              5         0       3  Allen, M...    male  35.0      0      0      373450   8.0500   NaN        S
5              6         0       3  Moran, M...    male   NaN      0      0      330877   8.4583   NaN        Q
6              7         0       1  McCarthy...    male  54.0      0      0       17463  51.8625   E46        S
7              8         0       3  Palsson,...    male   2.0      3      1      349909  21.0750   NaN        S
..           ...       ...     ...          ...     ...   ...    ...    ...         ...      ...   ...      ...
886          887         0       2  Montvila...    male  27.0      0      0      211536  13.0000   NaN        S
887          888         1       1  Graham, ...  female  19.0      0      0      112053  30.0000   B42        S
888          889         0       3  Johnston...  female   NaN      1      2  W./C. 6607  23.4500   NaN        S
889          890         1       1  Behr, Mr...    male  26.0      0      0      111369  30.0000  C148        C
890          891         0       3  Dooley, ...    male  32.0      0      0      370376   7.7500   NaN        Q

[888 rows x 12 columns]

In [5]:
## pp.64
data = {'Name' : ['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'],
       'Year' : [2011, 2016, 2015, 2015],
       'Gender' : ['Male', 'Female', 'Male', 'Male']
       }

data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [44]:
## Boolean Indexting (pp.72)
titanic_df = pd.read_csv('train.csv')
titanic_boolean = titanic_df[titanic_df['Age']>60]
#titanic_boolean
# titanic_boolean[['Name', 'Age']].head(3) ## over 2 columns : [[]]
# titanic_boolean.loc[:,['Name', 'Age']].head(3)
# titanic_df.loc[titanic_df['Age']>60, ['Name', 'Age']].head(3)
titanic_df[(titanic_df['Age']>60) & (titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

In [79]:
## Sort/Aggregation/Group-by (pp.75)
titanic_sorted = titanic_df.sort_values(by=['Pclass','Name'],ascending=False)
# titanic_df[['Age', 'Fare']].mean()
titanic_groupby = titanic_df.groupby(by='Pclass')
# titanic_groupby.count()
data = {'Passengers': titanic_groupby['PassengerId'].count(),
       'Age' : titanic_groupby['Age'].mean(),
        'Survived' : titanic_groupby['Survived'].mean(),
        'Fare' : titanic_groupby['Fare'].mean()
 }
Practice = pd.DataFrame(data)
# Practice
# titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId','Survived']].count()
# titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId']].count()
# titanic_groupby

# titanic_df.groupby('Pclass')['Age'].agg([max, min])
agg_format = {'PassengerId':'count', 'Survived':'mean','Age':'mean', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

        PassengerId  Survived        Age       Fare
Pclass
1               216  0.629630  38.233441  84.154687
2               184  0.472826  29.877630  20.662183
3               491  0.242363  25.140620  13.675550

In [88]:
## Missing Data (pp.79)
titanic_df.isna()
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [91]:
titanic_df['Cabin'].fillna('C000', inplace=True)
titanic_df['Age'].fillna(titanic_df['Age'].mean(), inplace=True)
titanic_df['Embarked'].fillna('S', inplace=True)
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [101]:
## Apply Lambda (pp.82)
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name','Name_len']]

titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else 'Adult')
titanic_df[['Age', 'Child_Adult']]

titanic_df['Age_Cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x<=60 else 'Elderly'))
titanic_df['Age_Cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_Cat, dtype: int64

In [106]:
def get_category(age):
    cat = ''
    if age<=5 : cat='Baby'
    elif age<=12 : cat='Child'
    elif age<=18 : cat='Teenager'
    elif age<=25 : cat ='Student'
    elif age<=35 : cat = 'Young Adult'
    elif age<=60 : cat = 'Adult'
    else : cat ='Elderly'
    return cat

titanic_df['Age_Cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age', 'Age_Cat']].head()
titanic_df['Age_Cat'].value_counts()

Young Adult    373
Adult          195
Student        162
Teenager        70
Baby            44
Child           25
Elderly         22
Name: Age_Cat, dtype: int64